# XMLSAXAddNodeValue

## Description
Write XML using SAX, adds a node value to a node begun with XMLSAXBeginNode.

```pascal
FUNCTION XMLSAXAddNodeValue(
				XMLHandle : LONGINT;
				nodeValue : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.XMLSAXAddNodeValue(XMLHandle, nodeValue):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|nodeValue|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML SAX